import matplotlib as mpl
import matplotlib.pyplot as plt
# pyplotモジュールを"plt"という名前でインポートする


# ================================ 折れ線グラフ
x = [0, 1, 2, 3, 5]  # x座標
y = [1, 5, 2, 6, 10]  # y座標

xx = [0, 1, 2, 3, 4, 5, 6, 20]
yy = [90, 777, 8888, 121, 333, 4, 29, 2]

# ************* ************* *************
# ************* バブルソート  *************
# ************* ************* *************
for i in range(len(yy)):
    for j in range(len(yy) - 1, i, -1):
        if yy[j - 1] > yy[j]:
            yy[j], yy[j - 1] = yy[j - 1], yy[j]

print(yy)

plt.plot(xx, yy, color="k")  # 点列(x,y)を黒線で繋いだプロット
plt.show()  # プロットを表示


# ================================ END 折れ線グラフ
